/* Даны координаты четырех точек на плоскости: ( x1, y1), ( x2, y2), ( x3, y3),
( x4, y4). Определить, образуют ли они выпуклый четырехугольник.*/


#include <stdio.h>
#include <locale.h>

int main() {
    setlocale(LC_ALL, "Russian");
    int x1, y1, x2, y2, x3, y3, x4, y4;

    printf("Введите координаты первой точки (x1, y1): ");
    scanf_s("%d %d", &x1, &y1);
    printf("Введите координаты второй точки (x2, y2): ");
    scanf_s("%d %d", &x2, &y2);
    printf("Введите координаты третьей точки (x3, y3): ");
    scanf_s("%d %d", &x3, &y3);
    printf("Введите координаты четвертой точки (x4, y4): ");
    scanf_s("%d %d", &x4, &y4);


    int cp1 = (x2 - x1) * (y3 - y1) - (y2 - y1) * (x3 - x1);
    int cp2 = (x3 - x2) * (y4 - y2) - (y3 - y2) * (x4 - x2);
    int cp3 = (x4 - x3) * (y1 - y3) - (y4 - y3) * (x1 - x3);
    int cp4 = (x1 - x4) * (y2 - y4) - (y1 - y4) * (x2 - x4);


    if ((cp1 > 0 && cp2 > 0 && cp3 > 0 && cp4 > 0) ||
        (cp1 < 0 && cp2 < 0 && cp3 < 0 && cp4 < 0)) {
        printf("Точки образуют выпуклый четырехугольник.\n");
    }
    else {
        printf("Точки не образуют выпуклый четырехугольник.\n");
    }

    return 0;
}
